using System;
using Discord;

public class NatsukiKarin : ICast
{
    readonly Random _random = new();

    public string GetName()
    {
        return "夏色花梨";
    }

    public string TokenFileName()
    {
        return "karin-token.txt";
    }

    public string GameName()
    {
        return "✨🍰✨";
    }

    public string CommandName()
    {
        return "karin-senpai";
    }

    public string[] GetReplyTexts()
    {
        return new[]
        {
            "こんにちは～", "みんな元気にしてた～？", "え、また見に来たの？", "別にいいけど。", "暇なの？", "ぴんぽんぱんぽーん", "もう私に会いたくなっちゃった？", "あなた、私を怒らせたわ",
            "がんばったね！", "かっこいいよ！", "ふんふ〜ん♪（鼻歌）", "呆れた・・", "ほんっとうに下手ね！", "変態なの？", "ばーかばーか", "アホなのかしら", "へんたい！",
            "ありがとう", "ありがとっ！", "ありがとうございました！", "ありがとね", "さんきゅ", "さーんきゅ", "はあああああああ？", "花梨よし！", "花梨の言うことは世界のことわり"
        };
    }

    public Embed GetHelpEmbedMessage()
    {
        var embed = new EmbedBuilder
        {
            Title = "夏色花梨のお呼び方",
            Fields =
            {
                new EmbedFieldBuilder
                {
                    Name = "karin-senpai help", Value = "このヘルプメッセージを出します", IsInline = false
                },
                new EmbedFieldBuilder
                {
                    Name = "karin-senpai", Value = "夏色花梨先輩がランダムにメッセージを投稿します", IsInline = false
                },
                new EmbedFieldBuilder
                {
                    Name = "karin-senpai yogurt", Value = "夏色花梨先輩がデザートを手に入れます", IsInline = false
                },
                new EmbedFieldBuilder
                {
                    Name = "karin-senpai start", Value = "夏色花梨先輩がメッセージの読み上げを開始します", IsInline = false
                },
                new EmbedFieldBuilder
                {
                    Name = "karin-senpai stop", Value = "夏色花梨先輩がメッセージの読み上げを停止します", IsInline = false
                }
            },
            Color = new Color(169, 105, 117)
        };
        return embed.Build();
    }

    public string[] GetRandomMessages()
    {
        return new[]
        {
            "はじめまして！", "お久しぶり～", "また会ったね", "皆さん、こんにちは", "皆さん、こんばんは", "こんにちは～", "こんばんは～", "夏色花梨です", "はじめまして！",
            "お久しぶり～！", "こんにちは", "こんばんは", "夏色花梨です", "はじめまして！", "お久しぶり～！", "みんな元気にしてた～？", "皆さん、こんにちはー！",
            "皆さん、こんばんはー！", "夏色花梨です！", "はじめまして～", "おひさしぶり～", "え、また見に来たの？", "別にいいけど。", "暇なの？", "じゃあ、はじめるよ",
            "べ・べ・べつに見に来てくれて嬉しくなんかないんだけど", "どうせなら最後まで見て行きなさいよね！", "最後まで見てくれたら嬉しいな・・・。", "夏色花梨様の実況、始めるわよ",
            "ありがたく聞きなさい", "前回のおさらいよ。覚えてるかしら", "また見なさい。これは命令よ", "ぴんぽんぱんぽーん", "ぴんぽんぱんぽーん", "前回のおさらい", "前回のおさらい",
            "前回のおさらい", "前回のおさらい", "次回予告！", "次回予告！", "次回予告！", "じ・か・い・よ・こ・く！", "じかいよこく～", "もう私に会いたくなっちゃった？",
            "私に魅了されちゃった皆さん、", "私の事、好きになっちゃった？　だったら～", "フォローしていってね！", "チャンネル登録、していってね！", "チャンネル登録や、フォローしていってね！",
            "チャンネル登録や、フォローおねがい！", "またみねて～！", "またみてね～！", "また見てね", "また見てね", "ま・た・み・て・ね", "またみてね～", "また見てね・・・",
            "ま・またみに来なさいよね！ばかっ", "まったね～！", "またね～", "またね・・・", "ま・た・ね", "またね", "ばいばい！", "ばいばーい！", "ばいば～い", "ばいばい～",
            "ばいばい", "ばいばい", "ばいばい", "じゃあね～", "私、夏色花梨がお送りしました", "私、夏色花梨と、（空白）で、お送りしました", "私、夏色花梨と、マキちゃんでお送りしました",
            "私、夏色花梨と、六花でお送りしました", "私、夏色花梨と、千冬でお送りしました", "夏色花梨がおおくりしました！", "私、夏色花梨と、（空白）で、お送りしました", "夏色花梨がおおくりしました！",
            "夏色花梨がおおくりしました！", "夏色花梨がおおくりしました～", "夏色花梨がおおくりしました", "夏色花梨と", "がお送りしました・・・", "夏色花梨がお送りしました・・・・",
            "いっけー！", "いけいけー！！！", "一撃！", "撃てえ！！！", "撃って撃ってうちまくるのよ！", "連打連打連打ー！！", "ファイヤー！！", "ゴー！！", "当ったれー！",
            "くらえー！！", "とーつーげーきー！", "ヒット！！！", "ヒットヒットー！", "いち、にの、さん！", "私の為に戦ってきて", "やったか？", "死にたいの？", "あなた、私を怒らせたわ",
            "あなたがそこにいるの、解ってるのよ", "私からは逃れられないの、わからないのかしら", "出てらっしゃい", "お馬鹿さん", "造作も無いわ", "ま、わたくしにかかればこんなものよね",
            "私、あなたを殺したくなかった", "さよなら", "さよなら", "えいっ！", "えいっ", "そいつは私の獲物よ？", "フフフ、いい的だわ", "見切った！", "止まって見えるわ",
            "どこを狙っているのかしら？", "落ち着け、、、落ち着け、、、", "動くと当たらないでしょ！", "なんか落ちてる", "終わってたまるかぁー！", "止まってたまるかぁー！",
            "死んでたまるかぁぁぁ！", "そこよ", "そこよ！！！", "ここはいけるっ！", "今よ", "今よ！！！", "ひゃん", "いたっ", "いったた", "いったぁ　くないわボケカスー！！！",
            "う”っ", "ぐっ", "ぐっ", "いってーなちくしょう", "きゃっ！！", "痛っ", "もう、痛いー！！", "あいたっ", "ぐはっ", "あん", "いたいいたい！！", "きゅーー",
            "あああああああん", "もおおおおおおお！", "やられた・・・", "え、やられたの？", "あ、死んだ", "えええ、そんなぁ", "やら・・・れた・・・", "きゃー！！", "きゃー！！",
            "いやあああああ", "たーすーけーてええええ", "ねええやめてよおおおおお", "やああめええてえええええ！", "あぶないっ！", "あぶなっ", "いやーん", "いじわるー！", "ひどーい！",
            "やめて！", "やめてよ！", "もうやめてってば！！", "やーめーてーーー", "ちょっと、やめてって！", "ちょっと、やめてって！", "ちょっと！やめてって！さっきから言ってるでしょー！",
            "コラー！！", "やめて", "やめてください", "いい加減にして", "ねえええやめてよ～", "え？ちょっと待って。", "そんなの聞いてないわよー！", "そんなの聞いてないわよぉ～",
            "やっちゃったぁ…", "あっまってまってまって", "どうしよう…", "あ〜もうラグ！！！（怒", "ちょっと！撃たないでよー！", "撃たないでって言ってるでしょ！", "倒れてえええええ",
            "誰か解って撃ってるの？", "あーん、もう！", "あーん、もうだめ～", "あーん、もうしんで！！", "そろそろしになさいよー！", "もお！ゆるさないからー！", "怒るよ！？",
            "クソゲーだわ～", "だめだめじゃん", "あきた！やめる！", "ちょっと！ありえないでしょ", "え、今の当たってるよね？", "今の、当たってるよ？", "嘘でしょ・・・", "生き返れバカー！",
            "あぶなっ", "ああああん、ごめんなさいいいい", "ゆるしてよおおぉ", "こ～な～い～で～！", "チートってやつじゃないの今の", "しくしく（わざとらしく", "こんなのあり？",
            "あんたバカー？", "今の見た！？", "何を見てヨシって言ったの？", "こんな事になるなんて…思ってなかったのよ…っ！！", "えっなにそれ聞いてない！", "もうやだおうちかえる…", "あつい！",
            "あついあついあつい", "死んでよおおおおお", "え、これで死なないの？", "死になさいよー！", "もう、なんでよー！！", "ちょっとー！ちゃんとやりなさいよー！",
            "えーもう、こんなん勝てるわけないじゃん…", "はいクソゲー", "げっ…", "もうムリ……", "もうムリ……", "む～り～", "もうムリもうムリ", "無理無理無理！",
            "無理無理無理無ー理ー", "もおおむーりーーー！", "こんなのできるわけないでしょ！", "い、今のなし、カット！", "ぶーぶー", "やだやだやだー", "え・・・まず・・・", "まずいまずい",
            "こわ・・・", "こっわ", "こわっ", "こわいこわいこわい", "ドーン", "ドッカーン", "バーン", "バババババ", "ギューン", "シャキーン", "キュイーン", "ぽーん",
            "対戦よろしくね！", "対戦ありがとう！", "対戦ありがとう・・・次は絶対負けないわ！", "対戦ありがとう・・・次は絶対負けないわ！", "笑い声", "笑い声", "笑い声", "うぷぷ",
            "ぐふふふふ", "げへへへへへ", "大きな笑い声", "んふふっ", "えへっ", "てへっ", "うふふふふふふふ", "あはは", "あはっ、、あはは", "げへへへ", "げへへへ",
            "あははは", "あはは", "えへへへ", "んふふふふふ", "あはははははは", "やるねー！", "やったー！", "うまいうまい！", "すごいじゃん！", "凄い・・", "すごーい",
            "凄いわね", "やるわね", "あんなの一撃でしょ～", "余裕じゃん", "へーきへーき", "上手～！", "素敵ー！", "かっこいい！", "下手～・・・", "うわぁ・・・", "みてらんない",
            "私がやろっか", "弱すぎね", "来世またいらっしゃい", "雑魚しかいないの？", "私が強くなりすぎたのね・・・", "もうやめたら？", "はい。おしまい", "お眠りなさい",
            "さ・よ・な・ら", "じゃあね", "じゃあね", "ゲームスタート！！", "スタート！！", "はじめよっ！", "ミッションクリア！", "ミッションコンプリート！", "クリアっ！",
            "ゴール！！", "がんばろっ！", "がんばろう", "もう一回がんばろう？", "まだまだ出来るよ！", "これからこれから！", "大丈夫大丈夫！", "諦めないで！", "よしっ", "よし！",
            "うん、よし！", "やった", "おっけー", "いいわよいいわよ", "さっすが私", "よしっ頑張ろう", "出来る出来る", "その調子よ", "その調子よ", "はい、もう一度",
            "あんたはそれでいいの？", "ちゃんとやって？", "ちゃんとやってください", "ちゃんとやって！", "しっかりしろ花梨、あんた先輩でしょ！", "ちょっと一回落ち着こう", "おめでとう！",
            "すごいじゃん！おめでとう～！", "がんばったね！", "かっこいいよ！", "楽しかった～", "がんばろう！", "まだまだできるよ！", "上手だね", "嬉しい", "ありがとう！",
            "ありがとね", "いいわね", "だいぶいい感じよ", "最高よ", "やるじゃない", "クリア！", "これで、クリア！", "エクセレント！", "マーベラス！", "パーフェクト！",
            "パーフェクトゲーム！", "フルコンボ！", "合格！", "記録更新！", "アーユーレディ？", "おめでとう！", "がんばりました！", "うわああああああ！！", "おめでとう！！",
            "やったー！！", "やったやったー！", "やったね！", "いいわよ", "今回だけよ", "今回だけは許してあげる", "ふんふ〜ん♪（鼻歌）", "失敗だわ", "最悪ね", "ダメダメね～",
            "ゲームオーバー", "不合格よ", "やっぱり駄目ね", "はい終了～", "まぁまぁね", "あっきれた", "呆れた・・", "もうちょっとなんとかならないの？", "ほんっとうに下手ね！",
            "はぁ？ まだやるの？", "変態なの？", "変態さんね", "ドヤァ", "だっるー", "だっるー", "めんどくさー", "うわっ、めんどくさ", "わあああああ", "わあああああ",
            "ばっかねー", "アホアホね", "ばーか", "ばーかばーか", "アホなのかしら", "雑魚ね", "あんのアホおおおおお", "ほんっとに", "もおおおお", "あんた、なんか企んでるでしょ",
            "口の利き方には気を付けてもらいましょうか", "はぁー？あなた何言ってんの？", "はぁぁぁぁー！？アンタ何言ってんの！？", "お前ら、後で絶ｯ対泣かす！！", "バッカじゃないの？",
            "バカばっかりね", "ただし六花、あなたはダメよ", "あんたはここで六花と死ぬのよ", "何事も暴力で解決するのが一番よ", "ここで終わりにするか続けるか、選びなさい。", "さぁ、懺悔の時間よ",
            "あなた、終わりね", "あんたたち、死んだわ", "運が悪かったわね", "やるか・・・", "えい！", "やっ！", "たっ！", "はっ！", "とう！", "はあー！！", "たあー！！",
            "おりゃー！", "うおおおおおおおお", "とりゃあああああああああ", "くっ", "く”う”っ”", "うっ", "痛っ", "いった！（痛った", "おい", "おいおい", "またかー",
            "え、そうなの？", "そうかな～", "嘘でしょｗ", "えー？（笑", "うーん", "うわー・・・", "うっわー・・・", "ひくわー・・・", "ないわー・・・", "最低ね", "さいってー",
            "きもっ", "きもちわる・・・", "変態・・・", "へんたい！", "えっち！", "ばか！", "ばかばかっ", "ばか・・・", "了解！", "りょーかいっ！", "OK!", "おっけー！",
            "花梨さんにまっかせなさい！", "いいよっ", "いいよ～", "ダメ！", "ダーメ！", "ダメだってば～！", "めっ", "きたああああ！！！", "おっ、きた？？", "ありがとう",
            "ありがとっ！", "ありがとうございました！", "ありがとね", "さんきゅ", "さーんきゅ", "サンキュー！", "ごめん！", "ごめーん！", "ごめんごめん！", "ごめんね！",
            "ごめんなさい", "えっ", "え？", "えー？（笑)", "えー？（笑)", "えええええ？（信じがたい)", "えっ？", "ええええええ？", "ええええええやだああああ", "なになに？",
            "ん？", "ん？", "ん？", "んー？", "はっ？", "はい？", "はあああ？", "はあああああああ？", "はあ”あ”あ”あ”あ”？", "うーん", "う”ーん”", "ううううううん",
            "ううううううん", "うん", "うんうん", "そうそう", "そのとおり！", "わかる～！", "わかるわかる！", "へえええ", "なるほどね～", "っはーーー", "っはーーー",
            "はぁぁぁ", "舌打ち", "舌打ち", "舌打ち", "舌打ち", "うえええ", "う”え”え”え”", "ん　んんっ！", "んふん！", "おほんっ！", "おほんおほん", "おほんおほん",
            "かっこいいバイクだね～", "車、かっこいい～！", "バイク・・かわいい", "車・・・かわいい", "ヘルメットよし！", "手袋よし！", "キーよし！", "左よし！", "右よし！",
            "前方よし！", "正面よし！", "後方よし！", "信号よし！", "花梨よし！", "安全確認よし！", "シートベルト、よし！", "ヨシ！", "準備万端！", "出発しよっ",
            "しゅっぱーつ！", "レッツゴー！", "そろそろ出発しよっ", "今日はどこに連れていってくれるの？", "今回の目的地はこちら！", "今日の目的地はこちら！", "今日はドライブ日和だね！",
            "今日は、雨だね・・・", "路面が滑りやすいから気をつけようね", "今日はあいにくの天気だけど、楽しんでドライブしよっ", "楽しみ～！！", "ナビはまかせて！", "ナビゲート役、がんばるね！",
            "安全運転してね？", "まっすぐ進んで～", "ずーっとまっすぐ", "しばらくまっすぐかな？", "次、右～", "次、右～", "次、左～", "次、左～", "右に曲がって", "左に曲がって",
            "止まってね", "高速に入って～", "高速を降りてね", "ここが異世界への入り口よ・・・", "お願い！囚われた千冬を助けて！！", "六花は・・・、あの子は私が倒すから！！",
            "青信号になったよ！", "青信号だよ", "黄色信号だよ", "赤信号だよ", "バックしてね", "そろそろ燃料切かも", "こ、ここは・・・どこ・・・", "まよっちゃった・・",
            "まよっちゃった・・", "まよっちゃった・・", "なんか歌いたくなっちゃった・・・", "なんか歌いたくなっちゃった・・・", "風が気持ちいい！", "あー！海ー！", "目的地についたよ！",
            "とうちゃ～く！", "運転おつかれさま！", "また一緒に走ろうね！", "なんか酔いそう・・", "エンジン・・かからない？", "ええっ？ガス欠？？", "ええっ？パンク？？", "あ、渋滞・・・",
            "あ、雨・・・", "ストーップ！", "止まって！", "あっ！あぶない！！", "あぶな！！", "車載主の朝ははやい", "あまっ", "あんま～", "あまーい", "しょっぱ",
            "しょっぱい・・・", "からっ", "から～い（辛い）", "できたー！", "ご飯が炊けたよ！", "もう焼けたかな？", "美味しく焼けたよー！", "もぐもぐ", "はふーはふーっ",
            "そろそろゴハンだよ～！", "ごはん♪ごはん♪", "かんぱーい！", "いただきまーす！", "美味しそう～！", "美味しい！", "美味しい！", "おーいしっ", "美味しいねこれ",
            "うっはあああああ", "美味しくない・・・", "まずい・・・", "まずい・・・", "まっず・・・", "ごちそうさま！", "美味しかったね～！", "おっ、かかった？", "ヒット！！",
            "巻け巻けー！！！", "大物！！！", "なんだコレ・・・", "あ、糸切れた・・・", "あぁ、逃げた・・・", "釣れた！！", "釣れ・・・てない・・・", "ゲットー！！", "酔いそう・・・",
            "リリース！", "元気でね！", "大漁大漁！！", "ボウズ・・・", "六花～", "六花ー", "ねえねえ六花～", "六花～！", "六花ー！", "六花やるじゃない！", "六花すごい！",
            "六花最高！", "六花かわいいわ", "六花上手ね！", "六花あんた下手ね", "六花？", "六花ちゃーん？", "六花ちゃあああん？", "おい小春", "ちょっとおおお！りっかあああ！",
            "六花！あれ！", "ねえ、六花", "六花ちゃん", "六花のアホー！", "六花のアホー！", "アホ六花ーーー！！！", "六花あああああああ？", "六花あああああああ？",
            "六花あああああああ？", "六花あんたほんっとあれ！", "六花のお団子をお食べ！", "千冬～", "千冬ー", "ねえねえ千冬～", "千冬～！", "千冬ー！", "千冬やるじゃない！",
            "千冬すごい！", "千冬最高！", "千冬かわいいわ", "いいわよ千冬", "千冬上手ね！", "千冬、あんた下手ね", "千冬？", "千冬ちゃーん？", "千冬ちゃあああん？", "おい花隈",
            "ちょっとおおお！ちーふーゆー！？", "ちーーーふーーーゆーーーー？？", "千冬ちゃん", "千冬！あれ！", "ねえ、千冬", "マキちゃーん", "マキマキー", "ねえねえマキマキ～",
            "マキマキ～！", "マキマキ～！", "マキマキー！", "マキマキ凄～い", "マキマキ上手ね！", "マキマキ下手～", "マキマキ？", "マキマキー？", "マキちゃあああん？",
            "おいマキマキ", "ちょっとおおお！マキマキー！？", "まーきーまーきー？？", "まーきーまーきー？？", "マキマキ！あれ！", "ねえ、マキマキ", "フリモメ～ン", "ねぇ、そこの青い人ー",
            "ねぇ、全身タイツの人ー", "ねぇ、ターコイズブルー筋肉ー", "フリモメン！", "フリモメン？", "全身タイツ？", "ちょっとおおお！フリモメン！？", "フーリーモーメーンー？？",
            "フリモメン！あれ！", "ねえ、フリモメン", "ねぇ、そもそもあなた何者なの？", "ねぇ、あなた何故青の全身タイツなのかしら", "恥ずかしくないの？", "花梨～", "花梨花梨～", "うん",
            "うんうん", "そうよ", "花梨の言う通りよ", "花梨の言うことが正しいわ", "花梨の言うことは世界のことわり", "花梨が正しいわ", "花梨、今日もかわいいわね",
            "何事も暴力で解決するのが一番よ", "あいつ、ムカつくわ", "あの人、頭おかしいわ", "あいつ、気に食わないから食べてもいいわよ", "あなたは何味？", "うちの花梨に文句があるの？食べるわよ？"
        };
    }

    public string GetRouletteCommandName()
    {
        return "dessert";
    }

    public Embed GetRouletteMessage()
    {
        string GetMessage()
        {
            var w = _random.NextDouble();
            return w switch
            {
                < 0.3 => $"夏色花梨先輩はドゥーブルフロマージュを{_random.Next(1, 6)}個手に入れました。",
                < 0.4 => $"夏色花梨先輩はベイクドチーズケーキを{_random.Next(1, 6)}個手に入れました。",
                < 0.5 => $"夏色花梨先輩はミルフィーユを{_random.Next(1, 6)}個手に入れました。",
                < 0.6 => $"夏色花梨先輩はエクレアを{_random.Next(1, 6)}個手に入れました。",
                < 0.65 => $"夏色花梨先輩はずんだ餅を{_random.Next()}個手に入れました。",
                < 0.8 => $"夏色花梨先輩はヨーグルトを{_random.Next(1, 6)}個手に入れました。",
                < 0.9 => $"夏色花梨先輩はいちごタルトを{_random.Next(1, 6)}個手に入れました。",
                _ => $"夏色花梨先輩はたこ焼きを{_random.Next(1, 6)}個後輩におごりました。"
            };
        }

        var embed = new EmbedBuilder
        {
            Title = "デザートちゃれんじ", Description = GetMessage(), Color = new Color(169, 105, 117)
        };

        return embed.Build();
    }

    public string StartBeforeParticipateMessage()
    {
        return "Voice Channelに入ってから呼んでね！";
    }

    public string StartMessage()
    {
        return " 読み上げを開始します！";
    }

    public string StopBeforeParticipateMessage()
    {
        return " まだ読み上げをしていないよ。";
    }

    public string StopMessage()
    {
        return " 読み上げを終了しまーす。";
    }
}
